# インストール先の指定
cask_args appdir: "/Applications"

# 外部ライブラリをインストール
tap "aws/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "weaveworks/tap"

# CLIアプリケーションの管理
brew "adsf"
brew "arp-scan"
brew "cocoapods"
brew "fselect"
brew "golang-migrate"
brew "golangci-lint"
brew "helm"
brew "hugo"
brew "jq"
brew "luajit", args: ["HEAD"]
brew "lv"
brew "mas"
brew "minikube"
brew "mint"
brew "neovim"
brew "nkf"
brew "nvm"
brew "openapi-generator"
brew "protobuf"
brew "pyenv"
brew "rustup-init"
brew "selenium-server", restart_service: true
brew "sqlc"
brew "swift-format"
brew "tfenv"
brew "tree"
brew "vite"
brew "watch"
brew "yarn"
brew "zsh-autosuggestions"
brew "aws/tap/copilot-cli"
brew "heroku/brew/heroku"
brew "weaveworks/tap/eksctl"

# デスクトップアプリケーションの管理
cask "chromedriver"
cask "google-chrome"
cask "inkscape"
cask "mono-mdk"
cask "unity-hub"
cask "visual-studio-code"

# Mac App Storeのアプリケーションを管理
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keyboard Keyboard", id: 1128271725
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LINE", id: 539883307
mas "MARKETSPEED", id: 946680495
mas "Microsoft PowerPoint", id: 462062816
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Twitter", id: 1482454543
mas "WPS Office", id: 1468073139
mas "Xcode", id: 497799835

# VScode の拡張機能を管理
vscode "42Crunch.vscode-openapi"
vscode "Arjun.swagger-viewer"
vscode "bierner.markdown-preview-github-styles"
vscode "burkeholland.simple-react-snippets"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "GitHub.copilot"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "jebbs.plantuml"
vscode "Meezilla.json"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mitchdenny.ecdc"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-dotnettools.csharp"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "patricklee.vsnotes"
vscode "pengyifu.x8664assemblys"
vscode "premparihar.gotestexplorer"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinhwagk.mkstring"
vscode "SteefH.external-formatters"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "Vue.volar"
vscode "whizkydee.material-palenight-theme"
vscode "yokoe.vscode-postfix-go"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
